Tekla Open API Reference for Tekla Structures 2025
LineSegment Operators
The LineSegment type exposes the following members.
Operators
Name | Description
Equality
 Checks the equality of two line segments.
Inequality
 Checks the inequality of two line segments.
Top
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace